cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Shell
brew 'atuin'
brew 'starship'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Dev tools
brew 'gh'
brew 'git-lfs'
brew 'lazygit'
brew 'mise'
brew 'pre-commit'
brew 'ripgrep'

# File & system utilities
brew 'btop'
brew 'eza'
brew 'mackup'
brew 'wget'
brew 'yt-dlp'

# Media
brew 'imagemagick'

# Network & tunnels
brew 'cloudflared'

# Local HTTPS
brew 'mkcert'
brew 'nss'

# Git extras
brew 'spaceman-diff'

# Apps
cask '1password'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'font-meslo-lg-nerd-font'
cask 'ghostty'
cask 'handbrake-app'
cask 'iina'
cask 'iterm2'
cask 'obsidian'
cask 'orbstack'
cask 'qlvideo'
cask 'raycast'
cask 'sequel-ace'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
